export default {
  dashboard: {
    cards: {
      totalNodes: 'Загальна кількість файлів',
      totalStorage: 'Загальний обсяг пам\'яті',
      totalUsers: 'Загальна кількість користувачів',
    },
    charts: {
      nodesGrowth: 'Зростання кількості файлів (12 місяців)',
      usersGrowth: 'Зростання кількості користувачів (за 12 місяців)',
    },
    description: 'На цій панелі управління ви можете керувати користувачами сайту та налаштуваннями.',
    error: 'Не вдалося завантажити статистику',
    loading: 'Завантаження статистики...',
    manageUsers: 'Управління користувачами',
    top: {
      byNodes: 'Найактивніші користувачі за кількістю файлів',
      byStorage: 'Користувачі з найбільшим обсягом використаного місця',
      nodes: 'Файли',
      storage: 'Пам\`ять',
      user: 'Користувач',
    },
    title: 'Панель адміністратора',
  },

  users: {
    headers: {
      action: 'Дія',
      createdAt: 'Створено',
      email: 'Електронна пошта',
      firstname: 'Ім\'я',
      lastname: 'Прізвище',
      name: 'Ім\'я',
      role: 'Роль',
    },
    noUsers: 'Користувачів не знайдено.',
    roles: {
      admin: 'Адмін',
      user: 'Користувач',
    },
    title: 'Управління користувачами',
  },
};
