export default {
  actions: {
    download: 'Скачати файл',
    upload: {
      idle: 'Завантажити',
      multiple: 'Завантажити {n} файл | Завантажити {n} файлів',
      progress: 'Завантаження {n} / {total}',
    },
  },

  appdrop: {
    addMore: 'Додати більше файлів',
    link: 'натисніть тут',
    max: 'Максимум {n} файлів',
    prompt: 'Перетягніть файл сюди або {link}, щоб вибрати',
    promptPlural: 'Перетягніть файли сюди або {link}, щоб вибрати',
    removeFile: 'Видалити файл',
  },

  edit: {
    description: 'Керуйте ресурсами та файлами на сервері. Ви можете редагувати метадані та видаляти файли.',
    title: 'Оновити файл',
  },

  labels: {
    originalPath: 'Початковий шлях',
    path: 'Шлях',
  },

  meta: {
    shortTitle: 'CDN',
    title: 'Файловий менеджер',
  },

  notifications: {
    error: 'Не вдалося завантажити {file}: {error}',
    successMsg: '{n} файл завантажено успішно | {n} файлів завантажено успішно',
    successTitle: 'Завантаження завершено',
  },

  page: {
    empty: 'Поки що файли не завантажено.',
  },

  preview: {
    title: 'Попередній перегляд',
    unavailable: 'Попередній перегляд недоступний для цього типу файлу',
  },

  storageUsed: "Використаний обсяг пам'яті",
};
