export default {
  nav: {
    login: 'Увійти',
    signup: 'Зареєструватися',
    home: 'Головна',
  },
  login: {
    title: 'Вхід',
    form: {
      username: "Ім'я користувача",
      password: 'Пароль',
      confirmPassword: 'Підтвердити пароль',
      submit: 'Увійти',
    },
    disabled: 'Вхід через локальні облікові записи наразі вимкнено. Будь ласка, скористайтеся одним із доступних провайдерів автентифікації нижче.',
    needAccount: 'Потрібен обліковий запис? Зареєструватися',
    forgotPassword: 'Забули пароль?',
    clickHere: 'Натисніть тут',
    OTP_2FA: {
      title: 'Двофакторна автентифікація',
      description: 'Будь ласка, введіть 6-значний код із вашого додатку для автентифікації.',
      code: 'Код автентифікації',
      submit: 'Підтвердити',
      back: 'Назад',
    },
    reset: {
      title: 'Скинути пароль',
      submit: 'Запросити скидання',
      change: 'Змінити пароль',
      havingIssues: 'Виникли проблеми?',
      contactUs: "Зв'яжіться з нами!",
      done: {
        title: 'Інструкції надіслано',
        description:
          "Перевірте свою електронну пошту на наявність посилання для скидання пароля. Якщо воно не з'явиться протягом кількох хвилин, перевірте папку зі спамом.",
        returnToLogin: 'Повернутися до входу',
      },
    },
    oidc: {
      title: 'Автентифікація...',
      description: 'Будь ласка, зачекайте, поки ми завершимо ваш вхід.',
      linked: "Ваш обліковий запис {{ providerName }} успішно пов'язано.",
      created: "Ваш обліковий запис успішно створено та пов'язано.",
      signIn: 'Ви успішно увійшли в систему.',
      redirectSettings: 'Перенаправлення до налаштувань...',
      redirectDashboard: 'Перенаправлення до панелі керування...',
      error: 'Помилка автентифікації',
      tryAgain: 'Спробувати знову',
      createAccount: 'Створити обліковий запис',
    },
  },
  signup: {
    title: 'Створення облікового запису',
    form: {
      username: "Ім'я користувача",
      email: 'Електронна пошта',
      emailDescription: 'Електронна пошта використовується лише для відновлення облікового запису. Вона не буде опублікована.',
      password: 'Пароль',
      confirmPassword: 'Підтвердити пароль',
      submit: 'Зареєструватися',
    },
    alreadyHaveAccount: 'Вже маєте обліковий запис? Увійти',
  },
};
