export default {
  actions: {
    download: 'Скачать файл',
    upload: {
      idle: 'Загрузить',
      multiple: 'Загрузить {n} файл | Загрузить {n} файла | Загрузить {n} файлов',
      progress: 'Загрузка {n} / {total}',
    },
  },

  appdrop: {
    addMore: 'Добавить ещё файлы',
    file: 'файл | файла | файлов',
    link: 'нажмите здесь',
    max: 'Не более {n} файла | Не более {n} файлов | Не более {n} файлов',
    prompt: 'Перетащите файл сюда или {link}, чтобы выбрать',
    promptMobile: 'Нажмите, чтобы выбрать файлы на устройстве',
    promptPlural: 'Перетащите файлы сюда или {link}, чтобы выбрать',
    removeFile: 'Убрать файл',
  },
  diagram: 'Редактор диаграмм',
  edit: {
    description: 'Управляйте ресурсами и файлами на сервере. Вы можете редактировать метаданные и удалять файлы.',
    title: 'Обновить файл',
  },

  labels: {
    originalPath: 'Исходный путь',
    path: 'Путь',
  },

  meta: {
    shortTitle: 'CDN',
    title: 'Файловый менеджер',
  },

  notifications: {
    error: 'Не удалось загрузить {file}: {error}',
    successMsg: '{n} файл успешно загружен | {n} файла успешно загружены | {n} файлов успешно загружено',
    successTitle: 'Загрузка завершена',
  },

  page: {
    empty: 'Пока нет загруженных файлов.',
  },

  preview: {
    title: 'Предпросмотр',
    unavailable: 'Предпросмотр недоступен для этого типа файлов',
  },

  storageUsed: 'Использовано места',
};
